* Classes
** Linear Algebra
*** DONE MyMathLab work <2015-09-21 Mon>
    CLOSED: [2015-09-20 Sun 14:47]
*** DONE MyMathLab work <2015-09-24 Thu>
    CLOSED: [2015-09-20 Sun 16:48]
*** Talk to Dr. Brown (just for kicks)
** Physics
*** Mastering Physics
**** DONE Finish assignment 3 continued <2015-09-23 Wed>
     CLOSED: [2015-09-26 Sat 19:21]
**** DONE Write last essay part for assignment 3 <2015-09-22 Tue>
     CLOSED: [2015-09-20 Sun 11:35]
**** DONE Finish lab work <2015-09-24 Thu>
     CLOSED: [2015-09-26 Sat 19:21]
     1. Parse lab data
     2. Write up report
** Production
*** DONE Write third blog <2015-09-23 Wed>
    CLOSED: [2015-09-20 Sun 23:13]
    CLOCK: [2015-09-20 Sun 19:44]--[2015-09-20 Sun 20:47] =>  1:03 - Logged
*** TODO Write fourth blog
*** Two Masters
**** DONE Work on it <2015-09-19 Sat>
     CLOSED: [2015-09-19 Sat 18:46]
     CLOCK: [2015-09-19 Sat 17:04]--[2015-09-19 Sat 18:46] =>  1:42 - Logged
*** Ripples
**** Outlining prototype for week 5 
     CLOCK: [2015-09-23 Wed 15:40]--[2015-09-23 Wed 16:53] =>  1:13 - Logged
**** Prototype Music Integration
***** Goals:
      CLOCK: [2015-09-28 Mon 01:23]--[2015-09-28 Mon 02:18] =>  0:55
      CLOCK: [2015-09-27 Sun 15:11]--[2015-09-27 Sun 17:03] => 1:52
      CLOCK: [2015-09-27 Sun 12:20]--[2015-09-27 Sun 14:51] =>  2:31
      1. Get beat matching working nicely for songs we add to the game.
      2. Get beat matching working for dynamically added songs.
      3. Think about secondary beat matching, i.e. the player is bumping to one theme and different enemies are on different themes. --THIS IS VERY POSSIBLE
      4. Look at interesting musical potential that comes up in the tools and think of uses.
***** Look at the viability of using beta Koreographer
      If this doesn't work, look into doing the stuff myself vs buying new Koreographer. file:Koreographer_Notes.org
** Networking
*** TODO [1/3] Assignment 1 <2015-10-09 Fri>
    1. [X] Set up parts that Saad explained in class <2015-09-19 Sat>
    2. [ ] Set up graphics library
    3. [ ] Do actual networking
* Personal
* Work
** TODO Grade flow charts <2015-09-21 Mon>
** DONE Grade assignments <2015-09-21 Mon>
   CLOSED: [2015-09-26 Sat 19:21]
   CLOCK: [2015-09-23 Wed 20:12]--[2015-09-23 Wed 22:03] =>  1:51
   CLOCK: [2015-09-21 Mon 13:30]--[2015-09-21 Mon 14:00] =>  0:30
